Tekla Open API Reference for Tekla Structures 2025
ProfileItem.ProfileItemCrossSections Property
 The list of profile item cross-sections.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IList<ProfileItemCrossSection> ProfileItemCrossSections { get; }
Public ReadOnly Property ProfileItemCrossSections As IList(Of ProfileItemCrossSection)
	Get
Property Value
Type: IList<ProfileItemCrossSection>
See Also
Reference
ProfileItem Class
Tekla.Structures.Catalogs Namespace